In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\dell\appdata\local\programs\python\python313\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\dell\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.3.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dell\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\dell\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\dell\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\dell\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
import pandas as pd
print(pd.__version__)

2.3.3

In [3]:
s = pd.Series([1, 3, 5, 7, 9])
s

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [4]:
df = pd.DataFrame({
    'Produkty': ['Chleb', 'Mleko', 'Jajka'],
    'Cena': [3.5, 2.0, 0.5],
    'Kategoria': ['Spożywcze']*3
})

In [5]:
df

  Produkty  Cena  Kategoria
0    Chleb   3.5  Spożywcze
1    Mleko   2.0  Spożywcze
2    Jajka   0.5  Spożywcze

In [9]:
df.head(2)

  Produkty  Cena  Kategoria
0    Chleb   3.5  Spożywcze
1    Mleko   2.0  Spożywcze

In [11]:
# Zadanie 1:
# Stwórz własną Series z pięcioma ulubionymi liczbami.
my_series = pd.Series([10, 20, 30, 40, 50])
my_series

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [12]:
# Zadanie 2:
# Zbuduj DataFrame z listy słowników opisujących książki (kolumny: Tytuł, Autor, Rok)
book_list = [
    {'Tytuł': '1984', 'Autor': 'George Orwell', 'Rok': 1949},
    {'Tytuł': 'To Kill a Mockingbird', 'Autor': 'Harper Lee', 'Rok': 1960},
    {'Tytuł': 'The Great Gatsby', 'Autor': 'F. Scott Fitzgerald', 'Rok': 1925}
]

books_df = pd.DataFrame(book_list)
books_df

                   Tytuł                Autor   Rok
0                   1984        George Orwell  1949
1  To Kill a Mockingbird           Harper Lee  1960
2       The Great Gatsby  F. Scott Fitzgerald  1925